## 인덱싱( Indexing )

In [45]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0], 
             index = ['a','b','c','d','e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [46]:
s[1] # index 번호로도 slicing이 가능

0.25

In [47]:
s['b'] # index의 이름으로도 slicing이 가능

0.25

In [48]:
s.keys() # keys를 쓰면 Series의 index 값을 반환한다.

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [49]:
a = pd.Series(index=[1, 2, 3, 4, 5])
for i, j in enumerate(s.keys()):
    a[i] = j
a

1      b
2      c
3      d
4      e
5    NaN
0      a
dtype: object

In [50]:
list(s.items()) # items( )메세드는 Series의 index값과 value들을 튜플로 반환한다.

[('a', 0.0), ('b', 0.25), ('c', 0.5), ('d', 0.75), ('e', 1.0)]

In [51]:
s['f']= 1.25  # dictionary형태로 Series에 새로운 index와 value를 입력하면 새로운 셀을 추가할 수 있다.
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
f    1.25
dtype: float64

In [52]:
s['a':'d']

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [53]:
s[ (s > 0.4) & (s < 0.8) ]

c    0.50
d    0.75
dtype: float64

In [54]:
d = pd.Series(data=range(1, 11), index=['a','b','c','d','e','f','g','h','i','j'])
print(d, end='\n')
d [ (d > 2) & (d < 7) ]

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

c    3
d    4
e    5
f    6
dtype: int64

In [55]:
d[ (d < 4 ) | (d > 9) ]

a     1
b     2
c     3
j    10
dtype: int64

### Series 인덱싱

In [56]:
s = pd.Series(['a','b','c','d','e'],
              index=[1, 3, 5, 7, 9])
s

1    a
3    b
5    c
7    d
9    e
dtype: object

In [57]:
s[1]

'a'

In [58]:
s[2:4]

5    c
7    d
dtype: object

In [59]:
s.iloc[1]

'b'

In [60]:
s.loc[1]

'a'

In [61]:
s

1    a
3    b
5    c
7    d
9    e
dtype: object

In [62]:
s.reindex(range(10))  # reindex는 index를 새로 생성하는데 기존에 있는 index와 value 모두가 추가하여 생성한다.

0    NaN
1      a
2    NaN
3      b
4    NaN
5      c
6    NaN
7      d
8    NaN
9      e
dtype: object

In [63]:
s.reindex(range(10), method='bfill')

0    a
1    a
2    b
3    b
4    c
5    c
6    d
7    d
8    e
9    e
dtype: object

In [64]:
s.reindex(range(10), method='ffill') # reindex를 하는데 앞의 값을 참조하여 해당 결측치를 채운다.
# 하지만 index[0]은 앞의 값이 존재하지 않기에 NaN값으로 나오게 된다.

0    NaN
1      a
2      a
3      b
4      b
5      c
6      c
7      d
8      d
9      e
dtype: object

### DataFrame 인덱싱

In [65]:
male_tuple = {'서울특별시': 4732275, 
              '부산광역시': 1668618,
              '인천광역시': 1476813,
              '대구광역시': 1198815,
              '대전광역시': 734441,
              '광주광역시': 720060}
male = pd.Series(male_tuple)

female_tuple = {'서울특별시': 4988571, 
                '부산광역시': 1735805,
                '인천광역시': 1470404,
                '대구광역시': 1229139,
                '대전광역시': 736599,
                '광주광역시': 734988}
female = pd.Series(female_tuple)

pop_tuple = {'서울특별시': 9720846, 
             '부산광역시': 3404423,
             '인천광역시': 2947217,
             '대구광역시': 2427954,
             '대전광역시': 1471040,
             '광주광역시': 1455048}
population = pd.Series(pop_tuple)

korea_df = pd.DataFrame({'인구수':population, 
                         '남자인구수':male,
                         '여자인구수':female})
# 컬럼명과 시리즈를 딕셔너리 형태로 묶어서 데이터 프레임을 만들수 있다.
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   720060   734988

In [66]:
korea_df.at['대전광역시','남자인구수']

734441

In [67]:
korea_df.at['서울특별시','인구수']

9720846

In [68]:
korea_df.at['부산광역시','남자인구수']

1668618

In [69]:
korea_df.at['인천광역시','여자인구수']
# korea_df.at['인천광역시':'대전광역시','남자인구수']
# 와 같이 at메소드에선 복수 index를 쓸수없다.

1470404

In [70]:
korea_df['남여비율'] = (korea_df.남자인구수 * 100 / korea_df.여자인구수)
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736599   99.707032
광주광역시  1455048   720060   734988   97.968946

#### values

In [71]:
korea_df.values

array([[9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01],
       [3.40442300e+06, 1.66861800e+06, 1.73580500e+06, 9.61293463e+01],
       [2.94721700e+06, 1.47681300e+06, 1.47040400e+06, 1.00435867e+02],
       [2.42795400e+06, 1.19881500e+06, 1.22913900e+06, 9.75329072e+01],
       [1.47104000e+06, 7.34441000e+05, 7.36599000e+05, 9.97070319e+01],
       [1.45504800e+06, 7.20060000e+05, 7.34988000e+05, 9.79689464e+01]])

In [72]:
df_index = pd.Index(['1번', '2번','3번'])
df = pd.DataFrame({'이름':['서준','인아', '인준'],
                   '수학':[90, 70, 80],
                   '영어':[98, 95, 80],
                   '음악':[85, 100, 80],
                   '체육':[100, 90, 80]}, 
                 index = df_index)
df

    이름  수학  영어   음악   체육
1번  서준  90  98   85  100
2번  인아  70  95  100   90
3번  인준  80  80   80   80

In [73]:
df.values

array([['서준', 90, 98, 85, 100],
       ['인아', 70, 95, 100, 90],
       ['인준', 80, 80, 80, 80]], dtype=object)

In [74]:
korea_df.values[0] # korea_df의 서울특별시의 value를 반환한다.

array([9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01])

In [75]:
df.values[0] # df의 1번 value를 반환한다.

array(['서준', 90, 98, 85, 100], dtype=object)

#### loc/ iloc
DataFrame 객체.loc[행 인덱스, 열 이름]  
DataFrame 객체.iloc[행 번호, 열 번호]

df.iloc[:]의 형태는 행번호에 범위를 지정하여  
그 범위에 해당하는 모든 열을 가져오는 결과값을 반환한다.

In [76]:
df.loc['1번':'2번']

    이름  수학  영어   음악   체육
1번  서준  90  98   85  100
2번  인아  70  95  100   90

In [77]:
df.iloc[0:2]

    이름  수학  영어   음악   체육
1번  서준  90  98   85  100
2번  인아  70  95  100   90

In [78]:
df.loc['1번', '영어']

98

In [79]:
df.iloc[0,2]

98

df.iloc[:,:]의 형태는 행 번호에 범위를 지정하고  
열 번호에도 해당 범위를 지정하여  
그 지정된 범위안의 원소를 반환한다.

In [80]:
df.loc['1번':'2번','수학':'음악']

    수학  영어   음악
1번  90  98   85
2번  70  95  100

In [81]:
df.iloc[0:2,1:4]

    수학  영어   음악
1번  90  98   85
2번  70  95  100

In [82]:
df.iloc[1:3,2:]

    영어   음악  체육
2번  95  100  90
3번  80   80  80

In [83]:
df.loc['2번':'3번','영어':]

    영어   음악  체육
2번  95  100  90
3번  80   80  80

In [84]:
korea_df.loc[ (korea_df.여자인구수 > 1000000)]

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907

In [85]:
df.loc[(df.수학 > 70)]

    이름  수학  영어  음악   체육
1번  서준  90  98  85  100
3번  인준  80  80  80   80

In [86]:
df[df.수학 > 70]

    이름  수학  영어  음악   체육
1번  서준  90  98  85  100
3번  인준  80  80  80   80

In [87]:
df.loc[(df.수학 != 80) & (df.영어 != 95)]

    이름  수학  영어  음악   체육
1번  서준  90  98  85  100

In [88]:
df[ (df.수학 != 80) & (df.영어 != 95) ]

    이름  수학  영어  음악   체육
1번  서준  90  98  85  100

### 다중 인덱스 (Multi Index)
- 1차원의 Series와 2차원의 DataFrame 객체를 넘어 3차원, 4차원 이상의 고차원 데이터 처리
- 단일 인덱스 내에 여러 인덱스를 포함하는 다중 인덱승

#### 다중 인덱스 Series

In [89]:
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736599   99.707032
광주광역시  1455048   720060   734988   97.968946

In [90]:
idx_tuples = [('서울특별시',2010), ('서울특별시',2020),
              ('부산광역시',2010), ('부산광역시',2020),
              ('인천광역시',2010), ('인천광역시',2020),
              ('대구광역시', 2010), ('대구광역시',2020),
              ('대전광역시', 2010), ('대전광역시',2020),
              ('광주광역시', 2010), ('광주광역시',2020)
             ]
idx_tuples

[('서울특별시', 2010),
 ('서울특별시', 2020),
 ('부산광역시', 2010),
 ('부산광역시', 2020),
 ('인천광역시', 2010),
 ('인천광역시', 2020),
 ('대구광역시', 2010),
 ('대구광역시', 2020),
 ('대전광역시', 2010),
 ('대전광역시', 2020),
 ('광주광역시', 2010),
 ('광주광역시', 2020)]

In [91]:
pop_tuples = [10312545, 9720846,
              2567910, 3404423,
              2758296, 2847217,
              2511676, 2427954,
              1503664, 1471040,
              1454636, 1455048]
population = pd.Series(pop_tuples, index = idx_tuples)
population

(서울특별시, 2010)    10312545
(서울특별시, 2020)     9720846
(부산광역시, 2010)     2567910
(부산광역시, 2020)     3404423
(인천광역시, 2010)     2758296
(인천광역시, 2020)     2847217
(대구광역시, 2010)     2511676
(대구광역시, 2020)     2427954
(대전광역시, 2010)     1503664
(대전광역시, 2020)     1471040
(광주광역시, 2010)     1454636
(광주광역시, 2020)     1455048
dtype: int64

In [92]:
midx = pd.MultiIndex.from_tuples(idx_tuples)
midx

MultiIndex([('서울특별시', 2010),
            ('서울특별시', 2020),
            ('부산광역시', 2010),
            ('부산광역시', 2020),
            ('인천광역시', 2010),
            ('인천광역시', 2020),
            ('대구광역시', 2010),
            ('대구광역시', 2020),
            ('대전광역시', 2010),
            ('대전광역시', 2020),
            ('광주광역시', 2010),
            ('광주광역시', 2020)],
           )

In [93]:
population = population.reindex(midx)
population.index.names = ['행정구역','년도']
population

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2847217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [94]:
df_tuples = [('1번','수학'), ('1번','영어'), ('1번','음악'),('1번','체육'),
             ('2번','수학'), ('2번','영어'), ('2번','음악'),('2번','체육'),
             ('3번','수학'), ('3번','영어'), ('3번','음악'),('3번','체육')]
mdf = pd.MultiIndex.from_tuples(df_tuples)
mdf

MultiIndex([('1번', '수학'),
            ('1번', '영어'),
            ('1번', '음악'),
            ('1번', '체육'),
            ('2번', '수학'),
            ('2번', '영어'),
            ('2번', '음악'),
            ('2번', '체육'),
            ('3번', '수학'),
            ('3번', '영어'),
            ('3번', '음악'),
            ('3번', '체육')],
           )

In [95]:
numbers = ['1번', '2번', '3번', '4번']
subjects = ['수학', '영어', '음악', '체육']
total = []

for i in numbers:
    for z in subjects:
        total.append((i, z))

total

[('1번', '수학'),
 ('1번', '영어'),
 ('1번', '음악'),
 ('1번', '체육'),
 ('2번', '수학'),
 ('2번', '영어'),
 ('2번', '음악'),
 ('2번', '체육'),
 ('3번', '수학'),
 ('3번', '영어'),
 ('3번', '음악'),
 ('3번', '체육'),
 ('4번', '수학'),
 ('4번', '영어'),
 ('4번', '음악'),
 ('4번', '체육')]

In [96]:
mdf = pd.MultiIndex.from_tuples(total)
mdf

MultiIndex([('1번', '수학'),
            ('1번', '영어'),
            ('1번', '음악'),
            ('1번', '체육'),
            ('2번', '수학'),
            ('2번', '영어'),
            ('2번', '음악'),
            ('2번', '체육'),
            ('3번', '수학'),
            ('3번', '영어'),
            ('3번', '음악'),
            ('3번', '체육'),
            ('4번', '수학'),
            ('4번', '영어'),
            ('4번', '음악'),
            ('4번', '체육')],
           )

In [97]:
score = [100, 90, 80, 70,
         92, 82, 72, 62,
         70, 80, 100, 90, 
         75, 70, 65, 70]
final_score = pd.Series(data=score, index=mdf)
final_score.index.names=['번호', '과목']
final_score

번호  과목
1번  수학    100
    영어     90
    음악     80
    체육     70
2번  수학     92
    영어     82
    음악     72
    체육     62
3번  수학     70
    영어     80
    음악    100
    체육     90
4번  수학     75
    영어     70
    음악     65
    체육     70
dtype: int64

In [98]:
final_score.unstack()

과목   수학  영어   음악  체육
번호
1번  100  90   80  70
2번   92  82   72  62
3번   70  80  100  90
4번   75  70   65  70

In [99]:
middle_term = [90, 80, 70, 60,
               87, 77, 67, 57,
               80, 90 , 90, 90,
               75, 70, 65, 70]
class_score_df = pd.DataFrame({'중간고사': middle_term, '기말고사': final_score})
class_score_df

       중간고사  기말고사
번호 과목
1번 수학    90   100
   영어    80    90
   음악    70    80
   체육    60    70
2번 수학    87    92
   영어    77    82
   음악    67    72
   체육    57    62
3번 수학    80    70
   영어    90    80
   음악    90   100
   체육    90    90
4번 수학    75    75
   영어    70    70
   음악    65    65
   체육    70    70

In [100]:
aver = (class_score_df['중간고사'].values + class_score_df['기말고사'].values) / 2

class_score_df = pd.DataFrame({'중간고사':middle_term,'기말고사':final_score,'평균':aver})
class_score_df

       중간고사  기말고사    평균
번호 과목
1번 수학    90   100  95.0
   영어    80    90  85.0
   음악    70    80  75.0
   체육    60    70  65.0
2번 수학    87    92  89.5
   영어    77    82  79.5
   음악    67    72  69.5
   체육    57    62  59.5
3번 수학    80    70  75.0
   영어    90    80  85.0
   음악    90   100  95.0
   체육    90    90  90.0
4번 수학    75    75  75.0
   영어    70    70  70.0
   음악    65    65  65.0
   체육    70    70  70.0

In [101]:
mdf1 = pd.MultiIndex.from_product([['영수','철수','영희'], ['수학','영어','체육', '음악']])
mdf1

MultiIndex([('영수', '수학'),
            ('영수', '영어'),
            ('영수', '체육'),
            ('영수', '음악'),
            ('철수', '수학'),
            ('철수', '영어'),
            ('철수', '체육'),
            ('철수', '음악'),
            ('영희', '수학'),
            ('영희', '영어'),
            ('영희', '체육'),
            ('영희', '음악')],
           )

#### 인덱싱 및 슬라이싱

In [102]:
middle_term = [90, 80, 70, 50,
               87, 77, 67, 60, 
               80, 90 , 90, 50]

mdf_s = pd.Series(middle_term, index = mdf1)
mdf_s.index.names = ['이름', '과목']
mdf_s

이름  과목
영수  수학    90
    영어    80
    체육    70
    음악    50
철수  수학    87
    영어    77
    체육    67
    음악    60
영희  수학    80
    영어    90
    체육    90
    음악    50
dtype: int64

In [103]:
mdf_s['영희', '영어']

90

In [104]:
mdf_s['영희']

과목
수학    80
영어    90
체육    90
음악    50
dtype: int64

In [105]:
final_score = [100, 90, 80, 70,
               92, 82, 72, 62,
               70, 80, 100 ,52]

In [106]:
class_score = pd.DataFrame({'중간고사':mdf_s, 
                            '기말고사':final_score})
class_score['평균'] = (class_score['중간고사'] + class_score['기말고사']) /2
class_score['순위'] = class_score['평균'].rank(method='first', ascending=False)
class_score

       중간고사  기말고사    평균    순위
이름 과목
영수 수학    90   100  95.0   1.0
   영어    80    90  85.0   4.0
   체육    70    80  75.0   7.0
   음악    50    70  60.0  11.0
철수 수학    87    92  89.5   3.0
   영어    77    82  79.5   6.0
   체육    67    72  69.5   9.0
   음악    60    62  61.0  10.0
영희 수학    80    70  75.0   8.0
   영어    90    80  85.0   5.0
   체육    90   100  95.0   2.0
   음악    50    52  51.0  12.0

In [107]:
def Make_grad(value):
    value = int(value)
    if value < 4:
        return '1등급'
    elif value < 8:
        return '2등급'
    else:
        return '3등급'

class_score['등급'] = class_score['순위'].apply(Make_grad)
class_score

       중간고사  기말고사    평균    순위   등급
이름 과목
영수 수학    90   100  95.0   1.0  1등급
   영어    80    90  85.0   4.0  2등급
   체육    70    80  75.0   7.0  2등급
   음악    50    70  60.0  11.0  3등급
철수 수학    87    92  89.5   3.0  1등급
   영어    77    82  79.5   6.0  2등급
   체육    67    72  69.5   9.0  3등급
   음악    60    62  61.0  10.0  3등급
영희 수학    80    70  75.0   8.0  3등급
   영어    90    80  85.0   5.0  2등급
   체육    90   100  95.0   2.0  1등급
   음악    50    52  51.0  12.0  3등급

#### 다중 인덱스 재정렬

In [108]:
# class_score['영수':'바둑이']
# 멀티인덱스는 초기 인덱스가 정렬이 되어 있지 않기 때문에 단순히 슬라이싱을 하면 에러가 나타난다.

class_score = class_score.sort_index()
class_score

       중간고사  기말고사    평균    순위   등급
이름 과목
영수 수학    90   100  95.0   1.0  1등급
   영어    80    90  85.0   4.0  2등급
   음악    50    70  60.0  11.0  3등급
   체육    70    80  75.0   7.0  2등급
영희 수학    80    70  75.0   8.0  3등급
   영어    90    80  85.0   5.0  2등급
   음악    50    52  51.0  12.0  3등급
   체육    90   100  95.0   2.0  1등급
철수 수학    87    92  89.5   3.0  1등급
   영어    77    82  79.5   6.0  2등급
   음악    60    62  61.0  10.0  3등급
   체육    67    72  69.5   9.0  3등급

In [109]:
class_score[:'영수']

       중간고사  기말고사    평균    순위   등급
이름 과목
영수 수학    90   100  95.0   1.0  1등급
   영어    80    90  85.0   4.0  2등급
   음악    50    70  60.0  11.0  3등급
   체육    70    80  75.0   7.0  2등급

In [110]:
class_score.index

MultiIndex([('영수', '수학'),
            ('영수', '영어'),
            ('영수', '음악'),
            ('영수', '체육'),
            ('영희', '수학'),
            ('영희', '영어'),
            ('영희', '음악'),
            ('영희', '체육'),
            ('철수', '수학'),
            ('철수', '영어'),
            ('철수', '음악'),
            ('철수', '체육')],
           names=['이름', '과목'])

In [111]:
# Index 형태가 위와 같이 Tuple 형태로 그룹화되어 있기 때문에
# class_score['영수','수학'] 형식이 실행되지 않는다.
class_score.loc[('영수','수학'),:]

중간고사      90
기말고사     100
평균      95.0
순위       1.0
등급       1등급
Name: (영수, 수학), dtype: object

In [112]:
class_score['영수':'영희']

       중간고사  기말고사    평균    순위   등급
이름 과목
영수 수학    90   100  95.0   1.0  1등급
   영어    80    90  85.0   4.0  2등급
   음악    50    70  60.0  11.0  3등급
   체육    70    80  75.0   7.0  2등급
영희 수학    80    70  75.0   8.0  3등급
   영어    90    80  85.0   5.0  2등급
   음악    50    52  51.0  12.0  3등급
   체육    90   100  95.0   2.0  1등급

In [113]:
class_score.unstack(level=0)

   중간고사         기말고사             평균                순위               등급       \
이름   영수  영희  철수   영수   영희  철수    영수    영희    철수    영수    영희    철수   영수   영희
과목
수학   90  80  87  100   70  92  95.0  75.0  89.5   1.0   8.0   3.0  1등급  3등급
영어   80  90  77   90   80  82  85.0  85.0  79.5   4.0   5.0   6.0  2등급  2등급
음악   50  50  60   70   52  62  60.0  51.0  61.0  11.0  12.0  10.0  3등급  3등급
체육   70  90  67   80  100  72  75.0  95.0  69.5   7.0   2.0   9.0  2등급  1등급


이름   철수
과목
수학  1등급
영어  2등급
음악  3등급
체육  3등급

In [114]:
class_score.unstack(level=1)

   중간고사             기말고사                 평균                     순위             \
과목   수학  영어  음악  체육   수학  영어  음악   체육    수학    영어    음악    체육   수학   영어    음악
이름
영수   90  80  50  70  100  90  70   80  95.0  85.0  60.0  75.0  1.0  4.0  11.0
영희   80  90  50  90   70  80  52  100  75.0  85.0  51.0  95.0  8.0  5.0  12.0
철수   87  77  60  67   92  82  62   72  89.5  79.5  61.0  69.5  3.0  6.0  10.0

          등급
과목   체육   수학   영어   음악   체육
이름
영수  7.0  1등급  2등급  3등급  2등급
영희  2.0  3등급  2등급  3등급  1등급
철수  9.0  1등급  2등급  3등급  3등급

In [115]:
class_score.stack()

이름  과목
영수  수학  중간고사      90
        기말고사     100
        평균      95.0
        순위       1.0
        등급       1등급
    영어  중간고사      80
        기말고사      90
        평균      85.0
        순위       4.0
        등급       2등급
    음악  중간고사      50
        기말고사      70
        평균      60.0
        순위      11.0
        등급       3등급
    체육  중간고사      70
        기말고사      80
        평균      75.0
        순위       7.0
        등급       2등급
영희  수학  중간고사      80
        기말고사      70
        평균      75.0
        순위       8.0
        등급       3등급
    영어  중간고사      90
        기말고사      80
        평균      85.0
        순위       5.0
        등급       2등급
    음악  중간고사      50
        기말고사      52
        평균      51.0
        순위      12.0
        등급       3등급
    체육  중간고사      90
        기말고사     100
        평균      95.0
        순위       2.0
        등급       1등급
철수  수학  중간고사      87
        기말고사      92
        평균      89.5
        순위       3.0
        등급       1등급
    영어  중간고사      77
        기말고사      82
        평균      79.5
        순위       6.0
        등급       2등급
    음악  중간고사      60
        기말고사      62
        평균      61.0
        순위      10.0
        등급       3등급
    체육  중간고사      67
        기말고사      72
        평균      69.5
        순위       9.0
        등급       3등급
dtype: object

In [116]:
idx_flat = class_score.reset_index(level = 0)
idx_flat

    이름  중간고사  기말고사    평균    순위   등급
과목
수학  영수    90   100  95.0   1.0  1등급
영어  영수    80    90  85.0   4.0  2등급
음악  영수    50    70  60.0  11.0  3등급
체육  영수    70    80  75.0   7.0  2등급
수학  영희    80    70  75.0   8.0  3등급
영어  영희    90    80  85.0   5.0  2등급
음악  영희    50    52  51.0  12.0  3등급
체육  영희    90   100  95.0   2.0  1등급
수학  철수    87    92  89.5   3.0  1등급
영어  철수    77    82  79.5   6.0  2등급
음악  철수    60    62  61.0  10.0  3등급
체육  철수    67    72  69.5   9.0  3등급

In [117]:
idx_flat = class_score.reset_index(level = 1)
idx_flat

    과목  중간고사  기말고사    평균    순위   등급
이름
영수  수학    90   100  95.0   1.0  1등급
영수  영어    80    90  85.0   4.0  2등급
영수  음악    50    70  60.0  11.0  3등급
영수  체육    70    80  75.0   7.0  2등급
영희  수학    80    70  75.0   8.0  3등급
영희  영어    90    80  85.0   5.0  2등급
영희  음악    50    52  51.0  12.0  3등급
영희  체육    90   100  95.0   2.0  1등급
철수  수학    87    92  89.5   3.0  1등급
철수  영어    77    82  79.5   6.0  2등급
철수  음악    60    62  61.0  10.0  3등급
철수  체육    67    72  69.5   9.0  3등급

In [118]:
idx_flat = class_score.reset_index(level = (0, 1))
idx_flat

    이름  과목  중간고사  기말고사    평균    순위   등급
0   영수  수학    90   100  95.0   1.0  1등급
1   영수  영어    80    90  85.0   4.0  2등급
2   영수  음악    50    70  60.0  11.0  3등급
3   영수  체육    70    80  75.0   7.0  2등급
4   영희  수학    80    70  75.0   8.0  3등급
5   영희  영어    90    80  85.0   5.0  2등급
6   영희  음악    50    52  51.0  12.0  3등급
7   영희  체육    90   100  95.0   2.0  1등급
8   철수  수학    87    92  89.5   3.0  1등급
9   철수  영어    77    82  79.5   6.0  2등급
10  철수  음악    60    62  61.0  10.0  3등급
11  철수  체육    67    72  69.5   9.0  3등급

In [119]:
idx_flat.set_index(['이름','과목'])

       중간고사  기말고사    평균    순위   등급
이름 과목
영수 수학    90   100  95.0   1.0  1등급
   영어    80    90  85.0   4.0  2등급
   음악    50    70  60.0  11.0  3등급
   체육    70    80  75.0   7.0  2등급
영희 수학    80    70  75.0   8.0  3등급
   영어    90    80  85.0   5.0  2등급
   음악    50    52  51.0  12.0  3등급
   체육    90   100  95.0   2.0  1등급
철수 수학    87    92  89.5   3.0  1등급
   영어    77    82  79.5   6.0  2등급
   음악    60    62  61.0  10.0  3등급
   체육    67    72  69.5   9.0  3등급